# 3. Определить, какие из слов «attribute», «класс», «функция», «type»
#    невозможно записать в байтовом типе.

fir_word = b'attribute'
print(fir_word)

# sec_word = b'класс'
# print(sec_word)

# thr_word = b'функция'
# print(thr_word)

fou_word = b'type'
print(fou_word)

# Слова записанные на кириллице вызывают ошибку:
# SyntaxError: bytes can only contain ASCII literal characters.
